app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", 1]]
---
  def carnivores
    c = Department.find(1)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", 2]]
---
  def omnivores
    c = Department.find(2)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT 1  [["id", 3]]
---
  def herbivores
    c = Department.find(3)