app/controllers/finder_controller.rb

  def index
    @products = Product.all
---
SELECT "products".* FROM "products" ORDER BY product_id

  def search_results
    @keyword = params[:keyword]

    @products = Product.where("name LIKE ?", "%#{@keyword}%")
---
SELECT "products".* FROM "products" WHERE (name LIKE '%Pteryod%')